Autodesk.Revit.DB.Events.DocumentOpeningEventArgs.DocumentType
Type of the document, e.g. Project or Template.
Since:
2010

Autodesk.Revit.DB.Events.DocumentOpeningEventArgs.PathName
Path of the document to be opened.
Since:
2010

Autodesk.Revit.DB.Events.DocumentOpeningEventArgs
The event arguments used by the DocumentOpening event.
Since:
2010